app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login", "login_count", "password_salt", "perishable_token", "persistence_token", "single_access_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated


     begin
       ActiveRecord::Base.transaction do
         @user.save!